---
kind: property
id: P:Autodesk.Revit.DB.Events.ExternalDataInstanceRemovedFromDocumentEventArgs.TypeId
source: html/e25fd057-595b-6121-c699-670850c7e5e5.htm
---
# Autodesk.Revit.DB.Events.ExternalDataInstanceRemovedFromDocumentEventArgs.TypeId Property

The type id of the external data instance id that has been removed from Revit document.

## Syntax (C#)
```csharp
public ElementId TypeId { get; }
```